Switch>en
Switch#conft
Translating "conft"...domain server (255.255.255.255) % Name lookup aborted
Switch#cong t
            ^
% Invalid input detected at '^' marker.
	
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#int vlan 10
Switch(config-if)#ip address 192.168.10.4
% Incomplete command.
Switch(config-if)#ex
Switch(config)#int vlan 20
Switch(config-if)#ex
Switch(config)#int vlan 10
Switch(config-if)#ip address 192.168.10.4 255.255.255.0
Switch(config-if)#ex
Switch(config)#int vlan 20
Switch(config-if)#ip address 192.168.20.4 255.255.255.0
Switch(config-if)#int vlan 30
Switch(config-if)#ip address 192.168.30.4 255.255.255.0
Switch(config-if)#ex
Switch(config)#no sh
                   ^
% Invalid input detected at '^' marker.
	
Switch(config)#ex
Switch#
%SYS-5-CONFIG_I: Configured from console by console

Switch#no sh
          ^
% Invalid input detected at '^' marker.
	
Switch#do wr
          ^
% Invalid input detected at '^' marker.
	
Switch#ex









Switch con0 is now available






Press RETURN to get started.













Switch>do wr
          ^
% Invalid input detected at '^' marker.
	
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#do wr
Building configuration...
[OK]
Switch(config)#do wr
Building configuration...
[OK]
Switch(config)#d sh
% Ambiguous command: "d sh"
Switch(config)#no sh
                   ^
% Invalid input detected at '^' marker.
	
Switch(config)#vlan 10
Switch(config-vlan)#
%LINK-5-CHANGED: Interface Vlan10, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan10, changed state to up

Switch(config-vlan)#vlan 20
Switch(config-vlan)#
%LINK-5-CHANGED: Interface Vlan20, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan20, changed state to up

Switch(config-vlan)#vlan 30
Switch(config-vlan)#
%LINK-5-CHANGED: Interface Vlan30, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan30, changed state to up

Switch#


Switch(config)#interface FastEthernet 0/1
Switch(config-if)#swi
Switch(config-if)#swi
Switch(config-if)#switchport trunk encapsulation dot1q
Switch(config-if)#swi
Switch(config-if)#switchport mode trunk
Switch(config-if)#no sh
Switch(config-if)#
